12/data/attachments/942c3514bdbe95a1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d6253725-c8f0-43f9-8a64-f1a2ba3950fa</nif:username>
            <nif:friendToBeAdded>Caitlin_upon_Friend_80115_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>